Results/postgresql/load-threads-50-2.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /root/ycsb/config/postgresql.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
Adding shard node URL: jdbc:postgresql://vmpg3:5432/ycsb
Adding shard node URL: jdbc:postgresql://vmpg3:5432/ycsb
Adding shard node URL: jdbc:postgresql://vmpg3:5432/ycsb
[...]
Using 1 shards
Using 1 shards
Using 1 shards
[...]
 10 sec: 5652 operations; 563.28 current ops/sec; [INSERT AverageLatency(us)=45019.33] 
 20 sec: 11785 operations; 612.81 current ops/sec;  
 30 sec: 16951 operations; 516.5 current ops/sec;  
 40 sec: 21918 operations; 496.65 current ops/sec;  
 50 sec: 27730 operations; 581.14 current ops/sec;  
 60 sec: 33455 operations; 572.44 current ops/sec;  
 70 sec: 38247 operations; 479.15 current ops/sec;  
 80 sec: 44008 operations; 576.04 current ops/sec;  
 90 sec: 48951 operations; 494.25 current ops/sec;  
 100 sec: 54360 operations; 540.85 current ops/sec;  
 110 sec: 60320 operations; 595.94 current ops/sec;  
 120 sec: 66770 operations; 644.94 current ops/sec;  
 130 sec: 71790 operations; 501.95 current ops/sec;  
 140 sec: 77613 operations; 582.18 current ops/sec;  
 150 sec: 83732 operations; 611.84 current ops/sec;  
 160 sec: 88180 operations; 444.76 current ops/sec;  
 170 sec: 93639 operations; 545.85 current ops/sec;  
 180 sec: 99795 operations; 615.54 current ops/sec;  
 190 sec: 105701 operations; 590.54 current ops/sec;  
 200 sec: 111431 operations; 572.94 current ops/sec; [INSERT AverageLatency(us)=29159] 
 210 sec: 117696 operations; 626.37 current ops/sec;  
 220 sec: 122656 operations; 495.95 current ops/sec;  
 230 sec: 127800 operations; 514.35 current ops/sec;  
 240 sec: 133720 operations; 591.94 current ops/sec;  
 250 sec: 139076 operations; 535.55 current ops/sec;  
 260 sec: 144638 operations; 556.09 current ops/sec;  
 270 sec: 149372 operations; 473.35 current ops/sec;  
 280 sec: 154531 operations; 515.85 current ops/sec;  
 290 sec: 159192 operations; 466.01 current ops/sec;  
 300 sec: 162519 operations; 332.67 current ops/sec;  
 310 sec: 166588 operations; 406.82 current ops/sec;  
 320 sec: 172693 operations; 610.38 current ops/sec; [INSERT AverageLatency(us)=37065] 
 330 sec: 178398 operations; 570.39 current ops/sec;  
 340 sec: 183867 operations; 546.85 current ops/sec;  
 350 sec: 188821 operations; 495.3 current ops/sec;  
 360 sec: 194760 operations; 593.84 current ops/sec;  
 370 sec: 200188 operations; 542.75 current ops/sec;  
 380 sec: 205480 operations; 529.09 current ops/sec; [INSERT AverageLatency(us)=187283] 
 390 sec: 211021 operations; 554.04 current ops/sec;  
 400 sec: 216465 operations; 544.35 current ops/sec;  
 410 sec: 219379 operations; 291.34 current ops/sec;  
 420 sec: 225204 operations; 582.44 current ops/sec; [INSERT AverageLatency(us)=40560] 
 430 sec: 230129 operations; 492.4 current ops/sec;  
 440 sec: 235432 operations; 530.19 current ops/sec;  
 450 sec: 241141 operations; 570.84 current ops/sec;  
 460 sec: 246819 operations; 567.69 current ops/sec;  
 470 sec: 252391 operations; 557.14 current ops/sec;  
 480 sec: 257058 operations; 466.65 current ops/sec;  
 490 sec: 262669 operations; 560.99 current ops/sec;  
 500 sec: 268484 operations; 581.38 current ops/sec;  
 510 sec: 273382 operations; 489.75 current ops/sec; [INSERT AverageLatency(us)=41863.11] 
 520 sec: 279651 operations; 626.59 current ops/sec;  
 530 sec: 284962 operations; 531.05 current ops/sec;  
 540 sec: 288529 operations; 356.66 current ops/sec;  
 550 sec: 294022 operations; 549.19 current ops/sec;  
 560 sec: 299409 operations; 538.65 current ops/sec;   
 563 sec: 300000 operations; 167.8 current ops/sec;   
[OVERALL], RunTime(ms), 563640.0
[OVERALL], Throughput(ops/sec), 532.2546306152864
[INSERT], Operations, 300000
[INSERT], AverageLatency(us), 55873.26031333333
[INSERT], MinLatency(us), 17437
[INSERT], MaxLatency(us), 3925912
[INSERT], Return=0, 299996
[INSERT], 0, 55985.33059210526
[INSERT], 1000, 41961.574257425746
[INSERT], 2000, 44185.03087478559
[INSERT], 3000, 84196.90049751244
[INSERT], 4000, 48085.23870967742
[INSERT], 5000, 43663.99710982659
[INSERT], 6000, 37016.42405063291
[INSERT], 7000, 84908.47575057737
[INSERT], 8000, 49423.28911564626
[INSERT], 9000, 46271.32718894009
[INSERT], 10000, 42840.88762446657
[INSERT], 11000, 42953.19298245614
[INSERT], 12000, 69158.81278538813
[INSERT], 13000, 58152.25708502025
[INSERT], 14000, 48302.95275590551
[INSERT], 15000, 51920.69914529914
[INSERT], 16000, 57232.4713740458
[INSERT], 17000, 43775.61828737301
[INSERT], 18000, 42057.86797752809
[INSERT], 19000, 40484.62087912088
[INSERT], 20000, 56835.57794676806
[INSERT], 21000, 51989.49828178694
[INSERT], 22000, 48058.862068965514
[INSERT], 23000, 100196.66233766233
[INSERT], 24000, 54989.27746741154
[INSERT], 25000, 78862.96348314607
[INSERT], 26000, 75904.68531468531
[INSERT], 27000, 49658.62248322148
[INSERT], 28000, 52887.97504456328
[INSERT], 29000, 44959.82743362832
[INSERT], 30000, 48362.47077922078
[INSERT], 31000, 71601.80676328503
[INSERT], 32000, 99403.09539473684
[INSERT], 33000, 77307.46835443038
[INSERT], 34000, 50590.20411663808
[INSERT], 35000, 47820.62987012987
[INSERT], 36000, 64756.72903225807
[INSERT], 37000, 82407.05918367347
[INSERT], 38000, 49970.58666666667
[INSERT], 39000, 61218.92050209205
[INSERT], 40000, 51710.8745819398
[INSERT], 41000, 58750.58906882591
[INSERT], 42000, 50762.38888888889
[INSERT], 43000, 64753.15448851774
[INSERT], 44000, 47520.94227769111
[INSERT], 45000, 41003.23489010989
[INSERT], 46000, 49480.45198675497
[INSERT], 47000, 43378.59550561798
[INSERT], 48000, 53783.47826086957
[INSERT], 49000, 53119.29061371841
[INSERT], 50000, 45832.75803981623
[INSERT], 51000, 47903.33655394525
[INSERT], 52000, 49988.57297297297
[INSERT], 53000, 73658.69266055046
[INSERT], 54000, 55810.682261208574
[INSERT], 55000, 57293.78890876565
[INSERT], 56000, 47388.24077046549
[INSERT], 57000, 48684.68982229402
[INSERT], 58000, 46861.10977701544
[INSERT], 59000, 57988.73476702509
[INSERT], 60000, 54158.09660107335
[INSERT], 61000, 46470.616766467065
[INSERT], 62000, 131708.70479704798
[INSERT], 63000, 88299.54838709677
[INSERT], 64000, 55132.28672566372
[INSERT], 65000, 53951.65248226951
[INSERT], 66000, 71314.6576819407
[INSERT], 67000, 60446.826568265686
[INSERT], 68000, 60424.9363449692
[INSERT], 69000, 54579.65425531915
[INSERT], 70000, 66621.75
[INSERT], 71000, 56453.706994328924
[INSERT], 72000, 57691.23863636364
[INSERT], 73000, 36557.81840490797
[INSERT], 74000, 50102.375
[INSERT], 75000, 43462.06762589928
[INSERT], 76000, 46222.725757575754
[INSERT], 77000, 64638.13829787234
[INSERT], 78000, 65020.16551724138
[INSERT], 79000, 58710.441064638784
[INSERT], 80000, 52442.535652173916
[INSERT], 81000, 49465.63770491803
[INSERT], 82000, 48499.45062836625
[INSERT], 83000, 105855.084
[INSERT], 84000, 69115.97908745248
[INSERT], 85000, 54087.885869565216
[INSERT], 86000, 51656.95228628231
[INSERT], 87000, 90623.46216216216
[INSERT], 88000, 59740.31411530815
[INSERT], 89000, 54247.733215547705
[INSERT], 90000, 56773.830443159924
[INSERT], 91000, 46202.80763116057
[INSERT], 92000, 103374.34285714285
[INSERT], 93000, 48300.3550295858
[INSERT], 94000, 44026.41389728097
[INSERT], 95000, 43064.51274787536
[INSERT], 96000, 51613.94425087108
[INSERT], 97000, 90749.37352941177
[INSERT], 98000, 79112.11111111111
[INSERT], 99000, 53111.68476357268
[INSERT], 100000, 47717.4848
[INSERT], 101000, 43069.0
[INSERT], 102000, 47967.59903381643
[INSERT], 103000, 59404.394941634244
[INSERT], 104000, 43964.08708272859
[INSERT], 105000, 37346.57702020202
[INSERT], 106000, 50122.35084745763
[INSERT], 107000, 109020.95683453238
[INSERT], 108000, 45794.88379204893
[INSERT], 109000, 45842.04892966361
[INSERT], 110000, 42547.10818307906
[INSERT], 111000, 43502.42940320233
[INSERT], 112000, 51611.90845070423
[INSERT], 113000, 45677.38972809668
[INSERT], 114000, 58989.76953125
[INSERT], 115000, 42199.20367751061
[INSERT], 116000, 40930.7379032258
[INSERT], 117000, 42490.448979591834
[INSERT], 118000, 61254.74096385542
[INSERT], 119000, 43988.84683357879
[INSERT], 120000, 46617.78139534884
[INSERT], 121000, 42638.84448160535
[INSERT], 122000, 58302.67027027027
[INSERT], 123000, 85375.28418230564
[INSERT], 124000, 48428.35917721519
[INSERT], 125000, 46840.932692307695
[INSERT], 126000, 61985.4693877551
[INSERT], 127000, 50295.720588235294
[INSERT], 128000, 122382.58837209303
[INSERT], 129000, 60560.12724014337
[INSERT], 130000, 43571.34788937409
[INSERT], 131000, 69275.50370370371
[INSERT], 132000, 97922.87915407855
[INSERT], 133000, 43160.06956521739
[INSERT], 134000, 47373.32633279483
[INSERT], 135000, 56075.73048327138
[INSERT], 136000, 43652.33670520231
[INSERT], 137000, 48835.36363636364
[INSERT], 138000, 53397.702090592335
[INSERT], 139000, 46078.422047244094
[INSERT], 140000, 62790.5625
[INSERT], 141000, 48641.147840531565
[INSERT], 142000, 35244.818072289156
[INSERT], 143000, 52926.49662162162
[INSERT], 144000, 49444.502512562816
[INSERT], 145000, 55926.66852886406
[INSERT], 146000, 51668.3130287648
[INSERT], 147000, 40935.372789115645
[INSERT], 148000, 54599.27911275416
[INSERT], 149000, 44135.73726541555
[INSERT], 150000, 117325.61035422343
[INSERT], 151000, 50806.78347107438
[INSERT], 152000, 41303.38108484005
[INSERT], 153000, 100522.36101083033
[INSERT], 154000, 97264.59939759035
[INSERT], 155000, 49177.62881355932
[INSERT], 156000, 67956.44117647059
[INSERT], 157000, 54881.38617886179
[INSERT], 158000, 108929.7328990228
[INSERT], 159000, 49732.85451505017
[INSERT], 160000, 54716.95818181818
[INSERT], 161000, 70574.31294117647
[INSERT], 162000, 57974.47338403042
[INSERT], 163000, 96814.09032258064
[INSERT], 164000, 48298.37620578778
[INSERT], 165000, 47046.575899843505
[INSERT], 166000, 55471.4741697417
[INSERT], 167000, 48271.39238410596
[INSERT], 168000, 58332.939047619046
[INSERT], 169000, 41388.04189944134
[INSERT], 170000, 48521.79293739968
[INSERT], 171000, 42592.59691011236
[INSERT], 172000, 41142.09517241379
[INSERT], 173000, 60526.68810289389
[INSERT], 174000, 67193.90129449838
[INSERT], 175000, 43518.5469953775
[INSERT], 176000, 45681.029027576194
[INSERT], 177000, 59139.483935742974
[INSERT], 178000, 38679.1477124183
[INSERT], 179000, 50220.305
[INSERT], 180000, 38661.95214105793
[INSERT], 181000, 44727.18059701493
[INSERT], 182000, 55458.33208955224
[INSERT], 183000, 48127.50636942675
[INSERT], 184000, 45706.25806451613
[INSERT], 185000, 40402.85425101215
[INSERT], 186000, 39904.72703062583
[INSERT], 187000, 76499.30612244898
[INSERT], 188000, 46084.82201405152
[INSERT], 189000, 223452.5355191257
[INSERT], 190000, 52955.01615798923
[INSERT], 191000, 44450.318529862176
[INSERT], 192000, 42326.934631432545
[INSERT], 193000, 70130.3430420712
[INSERT], 194000, 67491.93214285714
[INSERT], 195000, 57587.121722846445
[INSERT], 196000, 53870.54774774775
[INSERT], 197000, 52918.925795053
[INSERT], 198000, 43231.07042253521
[INSERT], 199000, 43618.91233283804
[INSERT], 200000, 56428.104283054
[INSERT], 201000, 50589.55042735043
[INSERT], 202000, 64726.28509719222
[INSERT], 203000, 43038.53023909986
[INSERT], 204000, 45913.41158536585
[INSERT], 205000, 59398.86012526096
[INSERT], 206000, 52433.59290540541
[INSERT], 207000, 48244.90774299835
[INSERT], 208000, 36635.42619047619
[INSERT], 209000, 38084.10573248407
[INSERT], 210000, 129631.4862385321
[INSERT], 211000, 46241.07246376811
[INSERT], 212000, 69168.53771289538
[INSERT], 213000, 55419.012658227846
[INSERT], 214000, 92663.08021390374
[INSERT], 215000, 45054.95074626866
[INSERT], 216000, 41299.53591160221
[INSERT], 217000, 55077.79746835443
[INSERT], 218000, 49254.98259187621
[INSERT], 219000, 157480.98039215687
[INSERT], 220000, 112461.53131313132
[INSERT], 221000, 41003.79010695187
[INSERT], 222000, 122171.87044534413
[INSERT], 223000, 58317.54890219561
[INSERT], 224000, 46380.64803625378
[INSERT], 225000, 53694.44385026738
[INSERT], 226000, 56005.90566037736
[INSERT], 227000, 64113.228758169935
[INSERT], 228000, 57481.624060150374
[INSERT], 229000, 47599.931637519876
[INSERT], 230000, 51322.56323777403
[INSERT], 231000, 66880.72183908046
[INSERT], 232000, 49161.01615508885
[INSERT], 233000, 48294.01444622793
[INSERT], 234000, 44266.10962962963
[INSERT], 235000, 49489.60655737705
[INSERT], 236000, 47693.95215311005
[INSERT], 237000, 42284.935211267606
[INSERT], 238000, 44652.655303030304
[INSERT], 239000, 63679.40636042403
[INSERT], 240000, 56641.26565464896
[INSERT], 241000, 51618.9593220339
[INSERT], 242000, 65272.13930348259
[INSERT], 243000, 52653.08253968254
[INSERT], 244000, 43135.51472650771
[INSERT], 245000, 39414.031746031746
[INSERT], 246000, 53228.37142857143
[INSERT], 247000, 84742.20195439739
[INSERT], 248000, 93754.3399339934
[INSERT], 249000, 59975.47892074199
[INSERT], 250000, 49191.64144736842
[INSERT], 251000, 52939.84238178634
[INSERT], 252000, 68605.58256880734
[INSERT], 253000, 62307.74791666667
[INSERT], 254000, 42360.96433666191
[INSERT], 255000, 60284.65587044534
[INSERT], 256000, 43436.23131170663
[INSERT], 257000, 52932.342806394314
[INSERT], 258000, 53906.89819004525
[INSERT], 259000, 71201.28772635815
[INSERT], 260000, 41279.309746328436
[INSERT], 261000, 49961.41176470588
[INSERT], 262000, 51295.65025466893
[INSERT], 263000, 143983.84713375795
[INSERT], 264000, 868649.4193548387
[INSERT], 265000, 85459.46021505377
[INSERT], 266000, 47899.94470774091
[INSERT], 267000, 56995.373046875
[INSERT], 268000, 71166.54411764706
[INSERT], 269000, 54461.57068062827
[INSERT], 270000, 46720.377300613494
[INSERT], 271000, 44106.655375552284
[INSERT], 272000, 49563.59468438538
[INSERT], 273000, 40749.55376344086
[INSERT], 274000, 46566.85668789809
[INSERT], 275000, 124201.53441295547
[INSERT], 276000, 65929.77705627706
[INSERT], 277000, 51892.724199288255
[INSERT], 278000, 108618.55893536122
[INSERT], 279000, 121495.36956521739
[INSERT], 281000, 159897.0890688259
[INSERT], 282000, 53613.04452054795
[INSERT], 283000, 46696.05164319249
[INSERT], 284000, 59814.14619883041
[INSERT], 285000, 53739.044444444444
[INSERT], 286000, 43672.89361702128
[INSERT], 287000, 119856.44262295082
[INSERT], 288000, 48928.01589825119
[INSERT], 289000, 45530.37155963303
[INSERT], 290000, 46539.766561514196
[INSERT], 291000, 47547.2
[INSERT], 292000, 57450.54857142857
[INSERT], 293000, 143161.9633027523
[INSERT], 294000, 447415.22222222225
[INSERT], 295000, 90428.1784989858
[INSERT], 296000, 59071.47454175153
[INSERT], 297000, 589809.1818181818
[INSERT], 298000, 1203172.1333333333
[INSERT], 299000, 1588252.6
[INSERT], 300000, 807233.7166666667
[INSERT], 301000, 61013.23588709677
[INSERT], 302000, 49238.80756578947
[INSERT], 303000, 48589.9925093633
[INSERT], 304000, 73830.3311827957
[INSERT], 305000, 53317.208258527826
[INSERT], 306000, 58447.1593625498
[INSERT], 307000, 68062.89303482587
[INSERT], 308000, 89950.60542168675
[INSERT], 309000, 103728.34090909091
[INSERT], 310000, 54789.76637168141
[INSERT], 311000, 38874.19562419562
[INSERT], 312000, 39954.54606141522
[INSERT], 313000, 68575.96338672769
[INSERT], 314000, 51246.2487394958
[INSERT], 315000, 52836.84514925373
[INSERT], 316000, 45299.16812865497
[INSERT], 317000, 49951.61306532663
[INSERT], 318000, 54019.468581687615
[INSERT], 319000, 43905.77696793003
[INSERT], 320000, 46620.45807453416
[INSERT], 321000, 53256.894280762564
[INSERT], 322000, 60431.00804828974
[INSERT], 323000, 44530.846385542165
[INSERT], 324000, 68022.77097505669
[INSERT], 325000, 59190.37972166998
[INSERT], 326000, 50684.58417508417
[INSERT], 327000, 54403.665434380775
[INSERT], 328000, 44082.92644757433
[INSERT], 329000, 56636.39786856128
[INSERT], 330000, 58274.83522727273
[INSERT], 331000, 50208.357859531774
[INSERT], 332000, 52005.84042553192
[INSERT], 333000, 48119.194888178914
[INSERT], 334000, 50538.27212020033
[INSERT], 335000, 60430.576
[INSERT], 336000, 52451.504363001746
[INSERT], 337000, 64000.8898488121
[INSERT], 338000, 46162.78134556575
[INSERT], 339000, 161642.82887700535
[INSERT], 340000, 49449.080152671755
[INSERT], 341000, 63263.29142857143
[INSERT], 342000, 77962.61764705883
[INSERT], 343000, 220903.42753623187
[INSERT], 344000, 42856.145454545454
[INSERT], 345000, 54839.95081967213
[INSERT], 346000, 48982.86
[INSERT], 347000, 53447.19152854512
[INSERT], 348000, 49379.27142857143
[INSERT], 349000, 56146.17757009346
[INSERT], 350000, 42274.43300423131
[INSERT], 351000, 62165.117647058825
[INSERT], 352000, 46568.76282051282
[INSERT], 353000, 44071.02741702742
[INSERT], 354000, 64342.16062176166
[INSERT], 355000, 58261.690515806986
[INSERT], 356000, 50459.114478114476
[INSERT], 357000, 65540.50539956804
[INSERT], 358000, 39301.441333333336
[INSERT], 359000, 45144.621212121216
[INSERT], 360000, 49474.256955810146
[INSERT], 361000, 61403.257978723406
[INSERT], 362000, 134761.49458483755
[INSERT], 363000, 49616.980099502485
[INSERT], 364000, 55276.84241245136
[INSERT], 365000, 52900.32487309645
[INSERT], 366000, 41866.7638121547
[INSERT], 367000, 58772.566600397615
[INSERT], 368000, 51775.497418244406
[INSERT], 369000, 49511.72561983471
[INSERT], 370000, 61255.75659229209
[INSERT], 371000, 45761.19040247678
[INSERT], 372000, 45108.274566473985
[INSERT], 373000, 75482.41694915254
[INSERT], 374000, 51230.473958333336
[INSERT], 375000, 48959.13333333333
[INSERT], 376000, 42241.82036775106
[INSERT], 377000, 84592.2672413793
[INSERT], 378000, 49586.8896797153
[INSERT], 379000, 86872.4679144385
[INSERT], 380000, 54587.444444444445
[INSERT], 381000, 52734.8506097561
[INSERT], 382000, 48204.87333333334
[INSERT], 383000, 56205.75092936803
[INSERT], 384000, 50569.747107438016
[INSERT], 385000, 52340.11826086957
[INSERT], 386000, 64152.75646551724
[INSERT], 387000, 50007.17412935323
[INSERT], 388000, 62951.00421940928
[INSERT], 389000, 60915.183673469386
[INSERT], 390000, 46731.2052545156
[INSERT], 391000, 86853.47352941177
[INSERT], 392000, 60979.32075471698
[INSERT], 393000, 45386.58536585366
[INSERT], 394000, 54461.391621129325
[INSERT], 395000, 49008.380875202594
[INSERT], 396000, 45079.54725609756
[INSERT], 397000, 59889.783625731
[INSERT], 398000, 48293.55048859935
[INSERT], 399000, 75034.26898734177
[INSERT], 400000, 123769.0
[INSERT], 401000, 184641.6028169014
[INSERT], 402000, 43833.00724637681
[INSERT], 403000, 161443.09239130435
[INSERT], 404000, 67597.29274004683
[INSERT], 405000, 77249.21461187214
[INSERT], 406000, 185392.6947368421
[INSERT], 407000, 412081.0
[INSERT], 408000, 89516.63636363637
[INSERT], 409000, 52941.24827586207
[INSERT], 410000, 36865.64380264741
[INSERT], 411000, 51062.37823834197
[INSERT], 412000, 58914.792635658916
[INSERT], 413000, 41207.068681318684
[INSERT], 414000, 61053.989669421484
[INSERT], 415000, 49593.700490998366
[INSERT], 416000, 132706.56363636363
[INSERT], 417000, 45234.994100294985
[INSERT], 418000, 45153.32428115016
[INSERT], 419000, 52601.41806020067
[INSERT], 420000, 49734.48366013072
[INSERT], 421000, 52290.768670309655
[INSERT], 422000, 52188.68571428571
[INSERT], 423000, 55481.093904448106
[INSERT], 424000, 56539.104562737644
[INSERT], 425000, 47710.32859399684
[INSERT], 426000, 53073.86301369863
[INSERT], 427000, 128075.30278884462
[INSERT], 428000, 201091.9220779221
[INSERT], 429000, 57062.34059405941
[INSERT], 430000, 56515.105751391464
[INSERT], 431000, 50281.62098138748
[INSERT], 432000, 70367.68837209302
[INSERT], 433000, 64712.23245614035
[INSERT], 434000, 55210.37158469945
[INSERT], 435000, 62699.34349593496
[INSERT], 436000, 37236.240997229914
[INSERT], 437000, 85378.48066298342
[INSERT], 438000, 52970.350906095555
[INSERT], 439000, 49949.534843205576
[INSERT], 440000, 71960.26914153132
[INSERT], 441000, 43438.03662420382
[INSERT], 442000, 65691.49590163934
[INSERT], 443000, 41674.99020979021
[INSERT], 444000, 67642.17155756208
[INSERT], 445000, 54969.314183123875
[INSERT], 446000, 43642.342606149345
[INSERT], 447000, 47833.983818770226
[INSERT], 448000, 48548.91935483871
[INSERT], 449000, 56782.93927893738
[INSERT], 450000, 50548.79261862917
[INSERT], 451000, 53284.500846023686
[INSERT], 452000, 51024.66488413547
[INSERT], 453000, 50554.2336
[INSERT], 454000, 68239.73825503356
[INSERT], 455000, 52286.59892086331
[INSERT], 456000, 51195.7554438861
[INSERT], 457000, 45260.73692077728
[INSERT], 458000, 56461.662239089186
[INSERT], 459000, 51701.64021164021
[INSERT], 460000, 45108.266768292684
[INSERT], 461000, 46789.34393939394
[INSERT], 462000, 45762.60596546311
[INSERT], 463000, 46340.21589205397
[INSERT], 464000, 48638.10810810811
[INSERT], 465000, 84419.47474747474
[INSERT], 466000, 41045.477303989
[INSERT], 467000, 104670.63157894737
[INSERT], 468000, 68790.4806378132
[INSERT], 469000, 47150.8763866878
[INSERT], 470000, 52737.78984238179
[INSERT], 471000, 51134.779661016946
[INSERT], 472000, 56115.719626168226
[INSERT], 473000, 67515.38154613467
[INSERT], 474000, 80954.97014925373
[INSERT], 475000, 59623.74891774892
[INSERT], 476000, 120366.87016574586
[INSERT], 477000, 84024.44270833333
[INSERT], 478000, 48127.52978056426
[INSERT], 479000, 53557.37291280148
[INSERT], 480000, 51447.48148148148
[INSERT], 481000, 89376.01282051283
[INSERT], 482000, 55869.78802588997
[INSERT], 483000, 39712.07887700535
[INSERT], 484000, 45032.93674698795
[INSERT], 485000, 44334.340298507464
[INSERT], 486000, 49842.12080536913
[INSERT], 487000, 65024.43108504399
[INSERT], 488000, 55814.52437223043
[INSERT], 489000, 76066.6575
[INSERT], 490000, 70080.7465116279
[INSERT], 491000, 54358.29496402878
[INSERT], 492000, 66253.46206896551
[INSERT], 493000, 46656.4131097561
[INSERT], 494000, 45351.013595166165
[INSERT], 495000, 42932.82503556188
[INSERT], 496000, 44984.03328290469
[INSERT], 497000, 69133.0252293578
[INSERT], 498000, 42748.00303951368
[INSERT], 499000, 47237.34948604993
[INSERT], 500000, 56992.956273764255
[INSERT], 501000, 47375.29810725552
[INSERT], 502000, 71395.94188861985
[INSERT], 503000, 44282.37627118644
[INSERT], 504000, 87572.40892193309
[INSERT], 505000, 42337.791666666664
[INSERT], 506000, 86700.03468208092
[INSERT], 507000, 43769.79605263158
[INSERT], 508000, 96353.46398305085
[INSERT], 509000, 44215.0
[INSERT], 510000, 46422.2910798122
[INSERT], 511000, 40575.020161290326
[INSERT], 512000, 40393.61827956989
[INSERT], 513000, 51268.50340136055
[INSERT], 514000, 58946.934131736525
[INSERT], 515000, 47787.61881977671
[INSERT], 516000, 49558.53756260434
[INSERT], 517000, 51879.0523138833
[INSERT], 518000, 58131.63939899833
[INSERT], 519000, 45316.11111111111
[INSERT], 520000, 54337.22162162162
[INSERT], 521000, 45193.66717325228
[INSERT], 522000, 42600.244039270685
[INSERT], 523000, 47321.36635220126
[INSERT], 524000, 38428.267457180504
[INSERT], 525000, 57590.4375
[INSERT], 526000, 53623.49376114082
[INSERT], 527000, 44736.220113851996
[INSERT], 528000, 109858.27642276423
[INSERT], 532000, 579477.506122449
[INSERT], 533000, 99647.78333333334
[INSERT], 534000, 54855.2969588551
[INSERT], 535000, 54619.962025316454
[INSERT], 536000, 65341.18295739348
[INSERT], 537000, 78760.91608391609
[INSERT], 538000, 44204.61976047904
[INSERT], 539000, 54794.31743119266
[INSERT], 540000, 42160.115702479336
[INSERT], 541000, 45063.18373493976
[INSERT], 542000, 100479.81188118811
[INSERT], 543000, 63845.29399141631
[INSERT], 544000, 45524.20121951219
[INSERT], 545000, 48256.2632423756
[INSERT], 546000, 45242.721633888046
[INSERT], 547000, 142130.29439252336
[INSERT], 548000, 52870.107719928186
[INSERT], 549000, 40255.99190283401
[INSERT], 550000, 37741.29183400268
[INSERT], 551000, 76081.605
[INSERT], 552000, 49028.48186528497
[INSERT], 553000, 52316.25311942959
[INSERT], 554000, 56987.360655737706
[INSERT], 555000, 46285.2082616179
[INSERT], 556000, 39625.566780821915
[INSERT], 557000, 44850.98544698545
[INSERT], 558000, 37407.90297029703
[INSERT], 559000, 43009.33734939759
[INSERT], 560000, 31306.68813559322
[INSERT], 561000, 97106.16666666667
[INSERT], 562000, 32758.57
[INSERT], 563000, 43270.0
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 315.7
[CLEANUP], MinLatency(us), 148
[CLEANUP], MaxLatency(us), 1199
[CLEANUP], 0, 806.0
[CLEANUP], 3000, 217.0
[CLEANUP], 5000, 296.0
[CLEANUP], 7000, 346.0
[CLEANUP], 8000, 462.3333333333333
[CLEANUP], 9000, 254.25
[CLEANUP], 10000, 240.0
[CLEANUP], 11000, 210.8
[CLEANUP], 12000, 194.0
java -cp /root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/jdbc/target/jdbc-binding-0.1.4.jar:/root/ycsb/YCSB/jdbc/target/archive-tmp/jdbc-binding-0.1.4.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P /root/ycsb/config/postgresql.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load